Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/injury_benefit.html.txt.tmx
Source language: en
Languages: ga

source: Injury Benefit is one of the benefits available under the Occupational Injuries Benefit Scheme
ga: Ceann de na sochair é an Sochar Díobhála atá le fáil de réir Scéim na Sochar Gortuithe Ceirde

source: It is a weekly payment made to you if you are unfit for work due to:
ga: Íocaíocht sheachtainiúil é a dhéantar leat má tá tú neamhábalta chun na hoibre de bharr:

source: • An accident at work
ga: • Timpiste le linn na hoibre

source: • An accident while travelling (on an unbroken journey) directly to or from work
ga: • Timpiste agus tú ag taisteal (ar thuras gan bhriseadh) go díreach go dtí nó ag teacht go díreach ón obair

source: An occupational disease is a disease that you contract in the course of your employment or due to the work you do, for example, from contact with physical or chemical agents
ga: Is éard atá i ngalar ceirde galar a thagann ort le linn do chuid fostaíochta nó de dheasca na hoibre a dhéanann tú, mar shampla, de dheasca na teagmhála le gníomhaithe fisiceacha nó ceimiceacha

source: The Department of Social Protection has a list of Prescribed Occupational Diseases
ga: Tá liosta ag an Roinn Coimirce Sóisialaí a leagann amach na Galair Cheirde

source: To get Injury Benefit you must be unfit for work for more than 6 days as a result of the accident or disease (excluding Sundays or paid holiday leave)
ga: Le go bhfaighfeá Sochar Díobhála ní mór duit a bheith neamhábalta ar an obair de dheasca na timpiste nó an ghalair ar feadh breis agus 3 lá (seachas Dé Domhnaigh nó laethanta saoire íoctha)

source: However, even if you are not unfit for work for more than 6 days you are entitled to a declaration that an occupational accident occurred
ga: Mar sin féin, fiú amháin mura bhfuil tú neamhábalta ar an obair le breis agus 3 lá, tá tú i dteideal ráiteas a dhéanamh gur tharla timpiste cheirde

source: This safeguards your future rights to benefits under the Occupational Injuries Benefit Scheme (as not all work accidents and diseases result immediately in illness or disablement). Injury Benefit is taxable but you are unlikely to pay tax if it is your only income
ga: Cosnaíonn sé seo na cearta a bheidh agat ina dhiaidh sin ar shochair de réir Scéim na Sochar Gortuithe Ceirde mar ní i gcónaí a thagann an bhreoiteacht ná an neamhábaltacht chun cinn láithreach de dheasca timpistí nó galar ceirde

source: Social insurance (PRSI) contributions
ga: Ranníocaíochtaí árachais sóisialta (ÁSPC)

source: In general, people in employment insurable at PRSI Class A, D, J or M are covered for Injury Benefit
ga: Daoine atá cumhdaithe ag an ÁSPC Aicme A, D, J nó M, tá siad cumhdaithe go hiomlán maidir le Sochar Díobhála

source: For people insurable at class M, only employees under 16 years of age are covered
ga: Is é sin le rá, tá beagnach gach fostaí in Éirinn cumhdaithe maidir le Sochar Díobhála

source: You do not have to be insured under Class A, D, J or M for any particular length of time to qualify for Injury Benefit
ga: Ní gá duit a bheith faoi árachas de réir Aicme A, D, J nó M le haon achar ama ar leith le go mbeidh teideal agat ar Shochar Díobhála

source: You will qualify if you are unfit for work because of an accident at work or an occupational disease. Your illness or incapacity must last for more than 6 days (excluding Sundays or paid holiday leave)
ga: Beidh tú incháilithe má tá tú neamhábalta chun na hoibre de dheasca timpiste nó galair cheirde Caithfidh do bhreoiteacht nó do neamhábaltacht maireachtáil níos faide ná 3 lá (seachas Dé Domhnaigh nó laethanta saoire íoctha)

source: How long is Injury Benefit paid?
ga: Achar aimsire a n-íoctar an Sochar Díobhála

source: Injury Benefit is not paid for the first 6 days of your illness or incapacity
ga: Ní íoctar an Sochar Díobhála na chéad 6 lá de do bhreoiteacht nó de do neamhábaltacht

source: This was extended to 6 days from 3 days from 6 January 2014
ga: Nóta: ó 6 Eanáir 2014 síníodh é seo ó 3 lá go dtí 6 lá

source: Payment can be made for up to 26 weeks starting from the date of your accident or development of the disease
ga: Is féidir an íocaíocht a dhéanamh ar feadh chomh hard le 26 sheachtain ó dháta na timpiste nó ó theacht chun cinn an ghalair

source: If you are still unable to work after 26 weeks, you may be entitled to Illness Benefit, Disability Allowance or Supplementary Welfare Allowance
ga: Má tá tú fós neamhábalta ar an obair tar éis na tréimhse 26 sheachtain, b’fhéidir go mbeidh teideal agat ar Shochar Breoiteachta, Liúntas Míchumais nó Liúntas Leasa Forlíontach

source: You may also be entitled to Disablement Benefit if you suffer a loss of physical or mental faculty as a result of the accident or disease
ga: B’fhéidir freisin go mbeidh teideal agat ar Shochar Míchumais má chailleann tú aon chumas corpartha nó meabhrach de dheasca na timpiste nó an ghalair

source: Alternatively, if you do not qualify for Illness Benefit or another social welfare payment and you are getting Disablement Benefit, you may be eligible for Incapacity Supplement. If you are receiving Family Income Supplement (FIS) and cannot work because of an occupational illness or disease, payment of FIS may continue with Injury Benefit for up to 36 days (6 weeks)
ga: Ina mhalairt de chás, mura bhfuil tú incháilithe do Shochar Breoiteachta ná d’íocaíocht leasa shóisialaigh eile agus go bhfuil tú ag fáil Sochair Mhíchumais, b’fhéidir go mbeidh tú incháilithe don Fhorlíonadh Éagumais

source: Rehabilitative work and training
ga: Obair agus oiliúint athshlánaithe

source: You may take part in training or part-time work which is rehabilitative and get Injury Benefit
ga: Féadfaidh tú páirt a ghlacadh in oiliúint nó obair pháirtaimseartha atá ina n-oiliúint nó obair athshlánaithe agus Sochar Díobhála a fháil

source: If you wish to take part in a course of training or to undertake rehabilitative work, you must get prior written permission from the Department of Social Protection
ga: Más mian leat páirt a ghlacadh i gcúrsa oiliúna nó chun tabhairt faoi obair athshlánaithe, ní mór duit cead scríofa a fháil roimh ré ón Roinn Coimirce Sóisialaí

source: You do not need prior written permission to undertake:
ga: Ní gá duit cead scríofa roimh ré a fháil chun tabhairt faoin méid a leanas:

source: • light work for which no payment is, or would normally be, payable
ga: • obair éadroim nach n-íoctar aisti, nó nár ghnách go n-íocfaí aisti

source: • work which is done as part of treatment while you are in hospital or other similar institution and the earnings do not exceed €50.00 per week
ga: • obair a dhéantar mar chuid de chóireáil fad atá tú in ospidéal nó ina macasamhail d’institiúid agus nuair nach sáraíonn na tuillimh €50.00 sa tseachtain

source: • work under a scheme which is considered charitable in character where the earnings do not exceed €50.00 per week
ga: • obair faoi scéim a mheastar atá carthanúil ó thaobh cineáil de, nuair nach sáraíonn na tuillimh €50.00 sa tseachtain

source: If you have received Injury Benefit for the maximum period of 6 months and have transferred to Illness Benefit, you can apply for Partial Capacity Benefit
ga: Má fuair tú Sochar Díobhála don tréimhse uasta 6 mhí agus má aistríodh thú chuig Sochar Breoiteachta, féadfaidh tú iarratas a dhéanamh ar Shochar Cumais Pháirtigh

source: Rate of Injury Benefit in 2016 and up to 13 March 2017
ga: Ráta an tSochair Dhíobhála i 2016 agus roimh 13 Márta 2017

source: │Injury Benefit │Weekly rate, € │
ga: │Sochar Díobhála │Ráta seachtainiúil, € │

source: │Personal rate │188.00 │
ga: │Ráta pearsanta │188.00 │

source: │Increase for a Qualified Adult │124.80 │
ga: │Méadú le aghaidh Duine Fásta Incháilithe │124.80 │

source: │ │29.80 (full rate) │ │Increase for a Qualified Child │ │
ga: │Méadú le haghaidh Linbh Incháilithe │29.80 (ráta iomlán ) │

source: Rate of Injury Benefit from 13 March 2017
ga: Ráta an tSochair Dhíobhála ó 13 Márta 2017

source: │Personal rate │193.00 │
ga: │Ráta pearsanta │193.00 │

source: │Increase for a Qualified Adult │128.10 │
ga: │Méadú le aghaidh Duine Fásta Incháilithe │128.10 │

source: You may get an increase in your payment for an adult dependant and dependent children
ga: Féadfaidh tú méadú ar d’íocaíocht a fháil do dhuine fásta cleithiúnach agus do leanaí cleithiúnacha

source: You should apply for Injury Benefit within 21 days of becoming ill, otherwise you may lose benefit
ga: Níor mhór duit cur isteach ar an Sochar Díobhála faoi cheann 21 lá ón lá ar éirigh tú tinn, nó d’fhéadfá sochar a chailleadh

source: To apply for Injury Benefit, you should visit a doctor and get a First Social Welfare Medical Certificate (known as MC1)
ga: Le cur isteach ar an Sochar Díobhála, níor mhór duit dul chuig an dochtúir agus Teastas Dochtúra Leasa Shóisialaigh Tosaigh a fháil

source: The First Social Welfare Medical Certificate is both an application form and medical certificate for Injury Benefit
ga: Is éard atá sa Teastas Dochtúra Leasa Shóisialaigh Tosaigh foirm iarratais agus teastas dochtúra le chéile le haghaidh an tSochair Dhíobhála

source: Send it to the Injury Benefit Section - see 'Where to apply' below
ga: Cuir ar aghaidh é chuig an Rannóg Shochair Dhíobhála (féach ‘Cá háit a ndéanfaidh mé iarratas' anseo thíos)

source: You must see your doctor and forward an Intermediate Medical Certificate (known as MC2) each week for as long as you are unfit for work
ga: Níor mhór duit Teastas Dochtúra Idirmheánach a chur isteach gach seachtain chomh fada agus a bheidh tú neamhábalta ar an obair
